[
    { 
        "name": "the fate of ten", 
        "image": "/images/tfot.jpg",
        "category": "Book",
        "genre": "Sci-Fi/Fantasy",
        "type": "Novel",
        "pages": "1570",
        "author": "pittacus lore", 
        "series": "lorian legacies", 
        "partNo": "6",
        "totalparts": "7",
        "prequel":"The Revenge of Seven",
        "sequel": "United as One",
        "note": "The sixth and Second to last book in the #1 New York Times bestselling I Am Number Four series! For years the Garde have fought the Mogadorians in secret, but now the invasion has begun.",
        "summary": "The sixth and Second to last book in the #1 New York Times bestselling I Am Number Four series! For years the Garde have fought the Mogadorians in secret, but now the invasion has begun. Jhon is on the front lines in New York City. The odds may be stacked against him, but his best friend, Sam, has inexplicably developed a Legacy despite being human—and he isn't the only one. As the pair tracks down Five and Nine amidst the chaos, they encounter another teen with powers. Whether she is a friend or a foe, however, remains to be seen. Meanwhile, Six, Marina, and Adam are having a in Mexico. (They fought their way into the Sanctuary and were able to awaken the force hidden within, but they don't have any way to reach the others…and the Mogs are coming for them in full force. The Garde are stretched thin. Their only shot at saving the world is to eliminate the Mogadorian leader once and for all—but his fate is now irrevocably tied with Ella's. The Garde can't destroy one without the other.  And if they can't find another way to stop the Mogs, humanity will suffer the same fate as the Loric: annihilation.)",
        "publicationdate": "1st September 2015",
        "publishedby": "HarperCollins"
    },
    { 
        "name": "united as one", 
        "image": "/images/uao.jpg",
        "category": "Book",
        "genre": "Sci-Fi/Fantasy",
        "type": "Novel",
        "pages": "251",
        "author": "pittacus lore", 
        "series": "lorian legacies", 
        "partNo": "7",
        "totalparts": "7",
        "prequel":"The Revenge of Seven",
        "sequel": "N/A",
        "note": "The Mogadorians have invaded Earth. Their warships loom over our most populated cities and no country will risk taking them head on. The Garde are all that stand in the way, but they'll need an army of their own to win this fight.",
        "summary": "The Garde didn't start this war, but they'll do whatever it takes to end it once and for all... The Mogadorians have invaded Earth. Their warships loom over our most populated cities and no country will risk taking them head on. The Garde are all that stand in the way, but they'll need an army of their own to win this fight. The Garde have teamed up with the U.S. military, but it might not be enough. They need reinforcements, and they've found them in the most unexpected place. Teenagers from across the globe, like John Smith's best friend, Sam, have developed abilities. So John and the others must get to them before the Mogs, because if they don't their enemies will use these gifted teens for their own sinister plan. But after all the Mogadorians have taken from John—his home, his family, his friends, and the person he loves most—he might not want to put any more lives in danger. He's got nothing left to lose, and he's just discovered he has been given an incredible new Legacy. Now he can turn himself into the ultimate weapon. So will he risk his life to save the world, or will he realize that power in numbers will save us all? ",
        "publicationdate": "28th June 2016",
        "publishedby": "HarperCollins"
    },
    { 
        "name": "the lost hero", 
        "image": "/images/tlh.jpg",
        "category": "Book",
        "genre": "Mythology/Fantasy",
        "type": "Novel",
        "pages": "576",
        "author": "rick riordan", 
        "series": "the heroes of olympus", 
        "partNo": "1",
        "totalparts": "5",
        "prequel":"The Last Olympian",
        "sequel": "The Son of Neptune",
        "note": "the story tells of three unlikely friends: an amnesiac, an apparent kleptomaniac, and a mechanic who likes to play pranks, as they are thrown in together on a quest to save Hera, Queen of the gods, before she is lost to the world forever.",
        "summary": "Jason Grace awakens on a school bus which belongs to the Wilderness School, unable to remember anything about his past. He is next to Piper McLean, his apparent girlfriend and Leo Valdez, his apparent best friend. All three are part of a class field trip to the Grand Canyon. After they arrive there, a classmate, Dylan, turns into a storm spirit and attacks the trio and their trip leader, Coach Gleeson Hedge. In the ensuing fight, Jason battles the spirit and surprises everyone with his powers. Hedge is revealed to be a satyr and is captured by the storm spirit as it flees. A flying chariot with two demigods appear on the scene. The female demigod, Annabeth Chase, expresses her frustration upon seeing that her missing boyfriend, Percy Jackson, is not there as she expected due to him being missing for three days without a clue. Jason, Piper, and Leo are told that they are Greek demigods and are taken back to Camp Half-Blood. There, Leo is revealed as a son of Hephaestus, Piper as a daughter of Aphrodite and Jason as a son of Jupiter, though Hera, the Greek form of Juno tells him he is her champion",
        "publicationdate": "October 12, 2010",
        "publishedby": "Hyperion Books"
    },
    { 
        "name": "the son of neptune", 
        "image": "/images/tson.jpg",
        "category": "Book",
        "genre": "Mythology/Fantasy",
        "type": "Novel",
        "pages": "544",
        "author": "rick riordan", 
        "series": "the heroes of olympus", 
        "partNo": "2",
        "totalparts": "5",
        "prequel":"The Lost Hero",
        "sequel": "The Mark of Athena",
        "note": "Child of lightning, beware the earth, The giants' revenge the seven shall birth. The forge and dove shall break the cage, And death unleash through Hera's rage. To the north, beyond the gods, lies the legion's crown. Falling from ice, the son of Neptune shall drown-",
        "summary": "Twenty-two months after Percy Jackson's defense of Mount Olympus in The Last Olympian, Percy finds himself alone and on the run from monsters in northern California without his memories. With the guidance of Lupa, the wolf-goddess and protector of ancient Rome, he makes his way to Camp Jupiter, a Roman demigod training camp and counterpart to the Greek demigods' Camp Half-Blood. Upon arriving, he is attacked by Gorgons — Stheno and Euryale — and successfully defends a disguised Juno and the camp with the help of the guards on duty. Having been protected by Percy during the attack, Juno announces Percy's arrival with approval, identifying him as a son of Neptune. Nobody knows that he is actually a son of the Greek god Poseidon. She tells him privately that he can only regain his memory by learning to be a hero again and successfully surviving the challenges he encounters at camp. ",
        "publicationdate": "October 4, 2011",
        "publishedby": "Hyperion Books"
    },
    { 
        "name": "the battle of labyrinth", 
        "image": "/images/tbol.jpg",
        "category": "Book",
        "genre": "Mythology/Fantasy",
        "type": "Novel",
        "pages": "384",
        "author": "rick riordan", 
        "series": "percy jackson and the olympians", 
        "partno": "4",
        "totalparts": "5",
        "prequel":"The Titans Curse",
        "sequel": "The Last Olympian",
        "note": "The Battle of the Labyrinth is the fourth book of the Percy Jackson and the Olympians series written by Rick Riordan. The story tells of Annabeth Chase as she leads her friends in a quest to find the inventor of the infamous Labyrinth when they discover its role in a dark plot against the camp by Kronos' Arm",
        "summary": "Percy Jackson isn't expecting freshman orientation to be any fun. But when a mysterious mortal acquaintance appears at his potential new school, followed by demon cheerleaders, things quickly move from bad to worse. In this fourth installment of the blockbuster series, time is running out as war between the Olympians and the evil Titan lord Kronos draws near. Even the safe haven of Camp Half-Blood grows more vulnerable by the minute as Kronos's army prepares to invade its once impenetrable borders. To stop the invasion, Percy and his demigod friends must set out on a quest through the Labyrinth - a sprawling underground world with stunning surprises at every turn ",
        "publicationdate": "May 6, 2008",
        "publishedby": "Hyperion Books"
    },
    { 
        "name": "the last olympian", 
        "image": "/images/tlo.jpg",
        "category": "Book",
        "genre": "Mythology/Fantasy",
        "type": "Novel",
        "pages": "361",
        "author": "rick riordan", 
        "series": "percy jackson and the olympians", 
        "partNo": "5",
        "totalparts": "5",
        "prequel":"The Battle of Labyrinth",
        "sequel": "The Lost Hero",
        "note": "The Last Olympian is a novel by Rick Riordan, published on May 5, 2009. It is the fifth and final installment in the Percy Jackson and the Olympians series. This conclusion to the saga revolves around Percy Jackson, the son of Poseidon, as he leads his friends in a last stand to protect Mount Olympus and the rest of the world from Kronos and his army of titans and monsters",
        "summary": "Percy and his friend Rachel Elizabeth Dare drive to a ridge overlooking the Atlantic Ocean. There, Rachel reveals that her father is trying to get her to go to a finishing school, Clarion Ladies Academy, that she does not want to go to. She asks if Percy has decided whether he would go with her and her family for vacation or not. Before he could answer, Blackjack, Percy's pegasus, lands on the hood of the car with Charles Beckendorf, a son of Hephaestus, on his back. Beckendorf announces that it is time for them to take out the Princess Andromeda. Rachel kisses Percy and wishes him good luck. The two demigods then leave. In good humor, Beckendorf states that the kiss might be better left a secret to Annabeth Chase to which Percy agrees. The two see the ship and sneak onto it. A telekhine sees them, but is killed before he sounded the alarm. They then set Greek Fire explosives in the engine room. Percy leaves the room to distract the monsters on the ship, telling Beckendorf to meet him at the air pad. Percy is captured and brought before Luke, who is now housing Kronos from the events of The Battle of the Labyrinth. The Titan duels Percy for the fun of it, and he mentions a spy in camp. A few minutes later, Beckendorf appears. It is revealed that all the other explosives are already in place and there would be no time to escape the ship once they explode. This is realized by the enemy forces a moment too late as Beckendorf had made it look like he was only about to plant the bombs when he got captured. He silently convinces Percy to flee, but Percy refuses to leave him behind. Suddenly, a dracanae notices the trigger on Beckendorf's arm. Beckendorf moves to detonate the bomb, leaving Percy no choice but to escape the ship. He jumps off and wills the currents to speed him away. The ship explodes, and Percy blacks out, thinking only of Beckendorf. ",
        "publicationdate": "May 5, 2009",
        "publishedby": "Hyperion Books"
    },
    { 
        "name": "city of bones", 
        "image": "/images/cob.jpg",
        "category": "Book",
        "genre": "Fantasy",
        "type": "Novel",
        "pages": "361",
        "author": "cassandra clare", 
        "series": "the mortal instruments", 
        "partNo": "1",
        "totalparts": "6",
        "prequel":"N/A",
        "sequel": "City of Ashes",
        "note": "Clary is pulled into Shadowhunter's world with a vengeance, warriors dedicated to ridding the earth of demons — and keeping the odd werewolves and vampires in line. When her mother disappears and Clary herself is attacked by a demon. But why would demons be interested in an ordinary mundane like Clary? And how did she suddenly get the Sight? The Shadowhunters would like to know... ",
        "summary": "An evening at a New York nightclub takes an unexpected turn for 15-year-old Clary when she witnesses what looks like a murder - but the victim's body has vanished into thin air. What's even more strange is that her best friend Simon couldn't even see the attack take place. The next thing Clary knows, her mother has disappeared and a hideous monster is in her apartment. As she struggles to navigate a frightening new world in which werewolves roam the streets of China Town and vampires ride above the New York on flying motorbikes, Clary learns that she is one of the Shadowhunters - an ancient line of demon-hunters descended from angels. In dramatic circumstances she is thrown together with handsome young Shadowhunter Jace and his friends Isabelle and Alec, and together they set out to discover what has happened to Clary's mother, as well as to rescue the Shadowhunters' ancient and powerful Mortal Cup which has fallen into the wrong hands. But Clary's interference in the demon world soon leads to some shocking revelations, and the uncovering of some long-buried secrets. The first in the popular Mortal Instruments series, this novel is sure to grip teenage fans of urban fantasy and dark romance. Exciting and fast-paced, it will keep readers on the edge of their seats and leave them eager to read the next installments of Clary's story",
        "publicationdate": "March 27, 2007",
        "publishedby": "Simon & Schuster"
    },
    { 
        "name": "city of ashes", 
        "image": "/images/coa.jpg",
        "category": "Book",
        "genre": "Fantasy",
        "type": "Novel",
        "pages": "453",
        "author": "cassandra clare", 
        "series": "the mortal instruments", 
        "partNo": "2",
        "totalparts": "6",
        "prequel":"City of Bones",
        "sequel": "City of Glass",
        "note": "How can Clary stop Valentine if Jace is willing to betray everything he believes in to help their father?In this breathtaking sequel to City of Bones, Cassandra Clare lures her readers back into the dark grip of New York City's Downworld, where love is never safe and power becomes the deadliest temptation.",
        "summary": "Clary Fray just wishes that her life would go back to normal. But what's normal when you're a demon-slaying Shadowhunter, your mother is in a magically induced coma, and you can suddenly see Downworlders like werewolves, vampires and faeries? If Clary left the world of the Shadowhunters behind, it would mean more time with her best friend, Simon, who's becoming more than a friend. But the Shadowhunting world isn't ready to let her go—especially her handsome, infuriating, newfound brother, Jace. And Clary's only chance to help her mother is to track down rogue Shadowhunter Valentine, who is probably insane, certainly evil—and also her father. To complicate matters, someone in New York City is murdering Downworlder children. Is Valentine behind the killings—and if he is, what is he trying to do? When the second of the Mortal Instruments, the Soul-Sword, is stolen, the terrifying Inquisitor arrives to investigate and zooms right in on Jace. How can Clary stop Valentine if Jace is willing to betray everything he believes in to help their father? In this breathtaking sequel to City of Bones, Cassandra Clare lures her readers back into the dark grip of New York City's Downworld, where love is never safe and power becomes the deadliest temptation. ",
        "publicationdate": "March 27, 2007",
        "publishedby": "Simon & Schuster"
    },
    { 
        "name": "divergent", 
        "image": "/images/divergent.jpg",
        "category": "Book",
        "genre": "Sci-Fi/ Dystopian fiction/ Adventure",
        "type": "Novel",
        "pages": "260",
        "author": "vorinica roth", 
        "series": "divergent trilogy", 
        "partNo": "1",
        "totalparts": "3",
        "prequel":"N/A",
        "sequel": "Insurgent",
        "note": "The novel follows Beatrice 'Tris' Prior as she explores her identity within a society that defines its citizens by their social and personality-related affiliation with five different factions. Also driving the novel is a romantic subplot between Tris and one of her trainers in the Dauntless faction, nicknamed Four.",
        "summary": "In Beatrice Prior's dystopian Chicago, society is divided into five factions, each dedicated to the cultivation of a particular virtue—Candor (the honest), Abnegation (the selfless), Dauntless (the brave), Amity (the peaceful), and Erudite (the intelligent). On an appointed day of every year, all sixteen-year-olds must select the faction to which they will devote the rest of their lives. For Beatrice, the decision is between staying with her family and being who she really is—she can't have both. So she makes a choice that surprises everyone, including herself. During the highly competitive initiation that follows, Beatrice renames herself Tris and struggles to determine who her friends really are—and where, exactly, a romance with a sometimes fascinating, sometimes infuriating boy fits into the life she's chosen. But Tris also has a secret, one she's kept hidden from everyone because she's been warned it can mean death. And as she discovers a growing conflict that threatens to unravel her seemingly perfect society, she also learns that her secret might help her save those she loves . . . or it might destroy her.",
        "publicationdate": "April 25, 2011",
        "publishedby": "Harper Collins Publishers"
    },
    { 
        "name": "insergent", 
        "image": "/images/insergent.jpg",
        "category": "Book",
        "genre": "Sci-Fi/ Dystopian fiction/ Adventure",
        "type": "Novel",
        "pages": "325",
        "author": "vorinica roth", 
        "series": "divergent trilogy", 
        "partNo": "2",
        "totalparts": "3",
        "prequel":"Divergent",
        "sequel": "Allegiant",
        "note": "Starting where the last book left off, Tris, Four, Caleb Prior, Peter Hayes, and Marcus Eaton travel to Amity, where several surviving Abnegation are settled in. Amity issues a statement that all factions may seek refuge there as long as they reside in peace. Tris overhears Marcus confessing to the Amity speaker, Johanna Reyes, that Abnegation's leaders died to protect a secret.",
        "summary": "One choice can transform you-or it can destroy you. But every choice has consequences, and as unrest surges in the factions all around her, Tris Prior must continue trying to save those she loves--and herself--while grappling with haunting questions of grief and forgiveness, identity and loyalty, politics and love. Tris's initiation day should have been marked by celebration and victory with her chosen faction; instead, the day ended with unspeakable horrors. War now looms as conflict between the factions and their ideologies grows. And in times of war, sides must be chosen, secrets will emerge, and choices will become even more irrevocable--and even more powerful. Transformed by her own decisions but also by haunting grief and guilt, radical new discoveries, and shifting relationships, Tris must fully embrace her Divergence, even if she does not know what she may lose by doing so.",
        "publicationdate": "May 5, 2012",
        "publishedby": "Harper Collins Publishers"
    }
]

